Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>nxp.com</vendor>
  <name>MIMXRT1043</name>
  <version>1.0</version>
  <description>MIMXRT1043DFP6B</description>
  <licenseText>
Copyright 2016-2024 NXP
SPDX-License-Identifier: BSD-3-Clause
  </licenseText>
  <cpu>
    <name>CM7</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>AIPSTZ1</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ1_</prependToName>
      <headerStructName>AIPSTZ</headerStructName>
      <baseAddress>0x4007C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPR</name>
          <description>Master Priviledge Registers</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MPROT3</name>
              <description>Master 3 Priviledge, Buffer, Read, Write Control.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPROT2</name>
              <description>Master 2 Priviledge, Buffer, Read, Write Control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPROT1</name>
              <description>Master 1 Priviledge, Buffer, Read, Write Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPROT0</name>
              <description>Master 0 Priviledge, Buffer, Read, Write Control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACR</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC7</name>
              <description>Off-platform Peripheral Access Control 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC6</name>
              <description>Off-platform Peripheral Access Control 6</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC5</name>
              <description>Off-platform Peripheral Access Control 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC4</name>
              <description>Off-platform Peripheral Access Control 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC3</name>
              <description>Off-platform Peripheral Access Control 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC2</name>
              <description>Off-platform Peripheral Access Control 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC1</name>
              <description>Off-platform Peripheral Access Control 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC0</name>
              <description>Off-platform Peripheral Access Control 0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACR1</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC15</name>
              <description>Off-platform Peripheral Access Control 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC14</name>
              <description>Off-platform Peripheral Access Control 14</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC13</name>
              <description>Off-platform Peripheral Access Control 13</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC12</name>
              <description>Off-platform Peripheral Access Control 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC11</name>
              <description>Off-platform Peripheral Access Control 11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC10</name>
              <description>Off-platform Peripheral Access Control 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC9</name>
              <description>Off-platform Peripheral Access Control 9</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC8</name>
              <description>Off-platform Peripheral Access Control 8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
