Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
        <register>
          <name>GPR2</name>
          <description>GPR2 General Purpose Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXBS_L_AHBXL_HIGH_PRIORITY</name>
              <description>AXBS_L AHBXL master has higher priority.Do not set both DMA and AHBXL to high priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_AHBXL_HIGH_PRIORITY_0</name>
                  <description>AXBS_L AHBXL master does not have high priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_AHBXL_HIGH_PRIORITY_1</name>
                  <description>AXBS_P AHBXL master has high priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_L_DMA_HIGH_PRIORITY</name>
              <description>AXBS_L DMA master has higher priority.Do not set both DMA and AHBXL to high priority.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_DMA_HIGH_PRIORITY_0</name>
                  <description>AXBS_L DMA master does not have high priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_DMA_HIGH_PRIORITY_1</name>
                  <description>AXBS_L DMA master has high priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_L_FORCE_ROUND_ROBIN</name>
              <description>Force Round Robin in AXBS_L</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_FORCE_ROUND_ROBIN_0</name>
                  <description>AXBS_L masters are not arbitored in round robin, depending on DMA and AHBXL master priority settings.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_FORCE_ROUND_ROBIN_1</name>
                  <description>AXBS_L masters are arbitored in round robin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_P_M0_HIGH_PRIORITY</name>
              <description>AXBS_P M0 master has higher priority.Do not set both M1 and M0 to high priority.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_P_M0_HIGH_PRIORITY_0</name>
                  <description>AXBS_P M0 master doesn't have high priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_P_M0_HIGH_PRIORITY_1</name>
                  <description>AXBS_P M0 master has high priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_P_M1_HIGH_PRIORITY</name>
              <description>AXBS_P M1 master has higher priority.Do not set both M1 and M0 to high priority.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_P_M1_HIGH_PRIORITY_0</name>
                  <description>AXBS_P M1 master does not have high priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_P_M1_HIGH_PRIORITY_1</name>
                  <description>AXBS_P M1 master has high priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_P_FORCE_ROUND_ROBIN</name>
              <description>Force Round Robin in AXBS_P. This bit can override master M0 M1 high priority configuration.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_P_FORCE_ROUND_ROBIN_0</name>
                  <description>AXBS_P masters are not arbitored in round robin, depending on M0/M1 master priority settings.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_P_FORCE_ROUND_ROBIN_1</name>
                  <description>AXBS_P masters are arbitored in round robin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD_FILTER_BYPASS</name>
              <description>Disable CANFD filter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CANFD_FILTER_BYPASS_0</name>
                  <description>enable CANFD filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANFD_FILTER_BYPASS_1</name>
                  <description>disable CANFD filter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L2_MEM_EN_POWERSAVING</name>
              <description>enable power saving features on L2 memory</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_MEM_EN_POWERSAVING_0</name>
                  <description>none memory power saving features enabled, SHUTDOWN/DEEPSLEEP/LIGHTSLEEP will have no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_MEM_EN_POWERSAVING_1</name>
                  <description>memory power saving features enabled, set SHUTDOWN/DEEPSLEEP/LIGHTSLEEP (priority high to low) to enable power saving levels</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AUTO_CLK_GATING_EN</name>
              <description>Automatically gate off RAM clock when RAM is not accessed.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_AUTO_CLK_GATING_EN_0</name>
                  <description>disable automatically gate off RAM clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AUTO_CLK_GATING_EN_1</name>
                  <description>enable automatically gate off RAM clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L2_MEM_DEEPSLEEP</name>
              <description>control how memory enter Deep Sleep mode (shutdown periphery power, but maintain memory contents, outputs of memory are pulled low)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_MEM_DEEPSLEEP_0</name>
                  <description>no force sleep control supported, memory deep sleep mode only entered when whole system in stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_MEM_DEEPSLEEP_1</name>
                  <description>force memory into deep sleep mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_CLK_DIV</name>
              <description>Divider ratio control for mclk from hmclk. mclk frequency = 1/(n+1) * hmclk frequency.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_0</name>
                  <description>mclk frequency = hmclk frequency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_1</name>
                  <description>mclk frequency = 1/2 * hmclk frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_2</name>
                  <description>mclk frequency = 1/3 * hmclk frequency</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_255</name>
                  <description>mclk frequency = 1/256 * hmclk frequency</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_SW_RST</name>
              <description>MQS software reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_SW_RST_0</name>
                  <description>Exit software reset for MQS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_SW_RST_1</name>
                  <description>Enable software reset for MQS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_EN</name>
              <description>MQS enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_EN_0</name>
                  <description>Disable MQS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_EN_1</name>
                  <description>Enable MQS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_OVERSAMPLE</name>
              <description>Used to control the PWM oversampling rate compared with mclk.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_OVERSAMPLE_0</name>
                  <description>32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_OVERSAMPLE_1</name>
                  <description>64</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TMR_CNTS_FREEZE</name>
              <description>QTIMER1 timer counter freeze</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TMR_CNTS_FREEZE</name>
              <description>QTIMER2 timer counter freeze</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TMR_CNTS_FREEZE</name>
              <description>QTIMER3 timer counter freeze</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TMR_CNTS_FREEZE</name>
              <description>QTIMER4 timer counter freeze</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR3</name>
          <description>GPR3 General Purpose Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCRAM_CTL</name>
              <description>OCRAM_CTL[3] - write address pipeline control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCP_KEY_SEL</name>
              <description>Select 128-bit dcp key from 256-bit key from SNVS Master Key</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCP_KEY_SEL_0</name>
                  <description>Select [127:0] from SNVS Master Key as dcp key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCP_KEY_SEL_1</name>
                  <description>Select [255:128] from SNVS Master Key as dcp key</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM2_CTL</name>
              <description>OCRAM2_CTL[3] - write address pipeline control bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXBS_L_HALT_REQ</name>
              <description>Request to halt axbs_l</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_HALT_REQ_0</name>
                  <description>axbs_l normal run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_HALT_REQ_1</name>
                  <description>request to halt axbs_l</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_STATUS</name>
              <description>This field shows the OCRAM pipeline settings status, controlled by OCRAM_CTL bits respectively</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXBS_L_HALTED</name>
              <description>This bit shows the status of axbs_l</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_HALTED_0</name>
                  <description>axbs_l is not halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_HALTED_1</name>
                  <description>axbs_l is in halted status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
