Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
        <register>
          <name>LPCR</name>
          <description>SNVS_LP Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRTC_ENV</name>
              <description>Secure Real Time Counter Enabled and Valid When set, the SRTC becomes operational</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>SRTC is disabled or invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>SRTC is enabled and valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTA_EN</name>
              <description>LP Time Alarm Enable When set, the SNVS functional interrupt is asserted if the LP Time Alarm Register is equal to the 32 MSBs of the secure real time counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LP time alarm interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LP time alarm interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MC_ENV</name>
              <description>Monotonic Counter Enabled and Valid When set, the MC can be incremented (by write transaction to the LPSMCMR or LPSMCLR)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>MC is disabled or invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>MC is enabled and valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPWUI_EN</name>
              <description>LP Wake-Up Interrupt Enable This interrupt line should be connected to the external pin and is intended to inform the external chip about an SNVS_LP event (MC rollover, SRTC rollover, or time alarm )</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRTC_INV_EN</name>
              <description>If this bit is 1, in the case of a security violation the SRTC stops counting and the SRTC is invalidated (SRTC_ENV bit is cleared)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEEP_VALID</name>
                  <description>SRTC stays valid in the case of security violation (other than a software violation (HPSVSR[SW_LPSV] = 1 or HPCOMR[SW_LPSV] = 1)).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALIDATE</name>
                  <description>SRTC is invalidated in the case of security violation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DP_EN</name>
              <description>Dumb PMIC Enabled When set, software can control the system power</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMART_PMIC_ENABLED</name>
                  <description>Smart PMIC enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUMB_PMIC_ENABLED</name>
                  <description>Dumb PMIC enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOP</name>
              <description>Turn off System Power Asserting this bit causes a signal to be sent to the Power Management IC to turn off the system power</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEEP_ON</name>
                  <description>Leave system power on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TURN_OFF</name>
                  <description>Turn off system power.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVD_EN</name>
              <description>Digital Low-Voltage Event Enable By default the detection of a low-voltage event does not cause the pmic_en_b signal to be asserted</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCALB_EN</name>
              <description>LP Calibration Enable When set, enables the SRTC calibration mechanism</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>SRTC Time calibration is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>SRTC Time calibration is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCALB_VAL</name>
              <description>LP Calibration Value Defines signed calibration value for SRTC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD_0_PER_32768_TICKS</name>
                  <description>+0 counts per each 32768 ticks of the counter clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_1_PER_32768_TICKS</name>
                  <description>+1 counts per each 32768 ticks of the counter clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_2_PER_32768_TICKS</name>
                  <description>+2 counts per each 32768 ticks of the counter clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_15_PER_32768_TICKS</name>
                  <description>+15 counts per each 32768 ticks of the counter clock</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_16_PER_32768_TICKS</name>
                  <description>-16 counts per each 32768 ticks of the counter clock</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_15_PER_32768_TICKS</name>
                  <description>-15 counts per each 32768 ticks of the counter clock</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_2_PER_32768_TICKS</name>
                  <description>-2 counts per each 32768 ticks of the counter clock</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_1_PER_32768_TICKS</name>
                  <description>-1 counts per each 32768 ticks of the counter clock</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTN_PRESS_TIME</name>
              <description>This field configures the button press time out values for the PMIC Logic</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBOUNCE</name>
              <description>This field configures the amount of debounce time for the BTN input signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_TIME</name>
              <description>The ON_TIME field is used to configure the period of time after BTN is asserted before pmic_en_b is asserted to turn on the SoC power</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PK_EN</name>
              <description>PMIC On Request Enable The value written to PK_EN will be asserted on output signal snvs_lp_pk_en</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PK_OVERRIDE</name>
              <description>PMIC On Request Override The value written to PK_OVERRIDE will be asserted on output signal snvs_lp_pk_override</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPR_Z_DIS</name>
              <description>General Purpose Registers Zeroization Disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMKCR</name>
          <description>SNVS_LP Master Key Control Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASTER_KEY_SEL</name>
              <description>Master Key Select These bits select the SNVS Master Key output when Master Key Select bits are enabled by MKS_EN bit in the HPCOMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_OTPMK</name>
                  <description>Select one time programmable master key.</description>
                  <value>#0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_ZMK</name>
                  <description>Select zeroizable master key when MKS_EN bit is set .</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_COMBO</name>
                  <description>Select combined master key when MKS_EN bit is set .</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZMK_HWP</name>
              <description>Zeroizable Master Key hardware Programming mode When set, only the hardware key programming mechanism can set the ZMK and software cannot read it</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_PROG_MODE</name>
                  <description>ZMK is in the software programming mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_PROG_MODE</name>
                  <description>ZMK is in the hardware programming mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZMK_VAL</name>
              <description>Zeroizable Master Key Valid When set, the ZMK value can be selected by the master key control block for use by cryptographic modules</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>ZMK is not valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>ZMK is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZMK_ECC_EN</name>
              <description>Zeroizable Master Key Error Correcting Code Check Enable Writing one to this field automatically calculates and sets the ZMK ECC value in the ZMK_ECC_VALUE field of this register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>ZMK ECC check is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>ZMK ECC check is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZMK_ECC_VALUE</name>
              <description>Zeroizable Master Key Error Correcting Code Value This field is automatically calculated and set when one is written into ZMK_ECC_EN bit of this register</description>
              <bitOffset>7</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSVCR</name>
          <description>SNVS_LP Security Violation Control Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SV0_EN</name>
              <description>Security Violation 0 Enable This bit enables Security Violation 0 Input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 0 is disabled in the LP domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 0 is enabled in the LP domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV1_EN</name>
              <description>Security Violation 1 Enable This bit enables Security Violation 1 Input</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 1 is disabled in the LP domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 1 is enabled in the LP domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV2_EN</name>
              <description>Security Violation 2 Enable This bit enables Security Violation 2 Input</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 2 is disabled in the LP domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 2 is enabled in the LP domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV3_EN</name>
              <description>Security Violation 3 Enable This bit enables Security Violation 3 Input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 3 is disabled in the LP domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 3 is enabled in the LP domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV4_EN</name>
              <description>Security Violation 4 Enable This bit enables Security Violation 4 Input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 4 is disabled in the LP domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 4 is enabled in the LP domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV5_EN</name>
              <description>Security Violation 5 Enable This bit enables Security Violation 5 Input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 5 is disabled in the LP domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 5 is enabled in the LP domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
