Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
        <register>
          <name>PLL_USB1_TOG</name>
          <description>Analog USB1 480MHz PLL Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. 0 - Fout=Fref*20; 1 - Fout=Fref*22.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_USB_CLKS</name>
              <description>Powers the 9-phase PLL outputs for USBPHYn</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_USB_CLKS_0</name>
                  <description>PLL outputs for USBPHYn off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_USB_CLKS_1</name>
                  <description>PLL outputs for USBPHYn on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWER</name>
              <description>Powers up the PLL. This bit will be set automatically when USBPHY0 remote wakeup event happens.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable the PLL clock output.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked. 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS</name>
          <description>Analog System PLL Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x13001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. 0 - Fout=Fref*20; 1 - Fout=Fref*22.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN</name>
              <description>Powers down the PLL.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable PLL output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked; 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS_SET</name>
          <description>Analog System PLL Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x13001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. 0 - Fout=Fref*20; 1 - Fout=Fref*22.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN</name>
              <description>Powers down the PLL.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable PLL output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked; 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS_CLR</name>
          <description>Analog System PLL Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x13001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. 0 - Fout=Fref*20; 1 - Fout=Fref*22.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN</name>
              <description>Powers down the PLL.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable PLL output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked; 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS_TOG</name>
          <description>Analog System PLL Control Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x13001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. 0 - Fout=Fref*20; 1 - Fout=Fref*22.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN</name>
              <description>Powers down the PLL.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable PLL output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked; 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS_SS</name>
          <description>528MHz System PLL Spread Spectrum Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP</name>
              <description>Frequency change step = step/CCM_ANALOG_PLL_SYS_DENOM[B]*24MHz.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Spread spectrum modulation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Spread spectrum modulation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Frequency change = stop/CCM_ANALOG_PLL_SYS_DENOM[B]*24MHz.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS_NUM</name>
          <description>Numerator of 528MHz System PLL Fractional Loop Divider Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>A</name>
              <description>30 bit numerator (A) of fractional loop divider (signed integer).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SYS_DENOM</name>
          <description>Denominator of 528MHz System PLL Fractional Loop Divider Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>B</name>
              <description>30 bit denominator (B) of fractional loop divider (unsigned integer).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_AUDIO</name>
          <description>Analog Audio PLL control Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. Valid range for DIV_SELECT divider value: 27~54.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN</name>
              <description>Powers down the PLL.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable PLL output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DIV_SELECT</name>
              <description>These bits implement a divider after the PLL, but before the enable and bypass mux.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POST_DIV_SELECT_0</name>
                  <description>Divide by 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POST_DIV_SELECT_1</name>
                  <description>Divide by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POST_DIV_SELECT_2</name>
                  <description>Divide by 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked. 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_AUDIO_SET</name>
          <description>Analog Audio PLL control Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SELECT</name>
              <description>This field controls the PLL loop divider. Valid range for DIV_SELECT divider value: 27~54.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN</name>
              <description>Powers down the PLL.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable PLL output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SRC</name>
              <description>Determines the bypass source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_24M</name>
                  <description>Select the 24MHz oscillator as source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Select the CLK1_N / CLK1_P as source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the PLL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DIV_SELECT</name>
              <description>These bits implement a divider after the PLL, but before the enable and bypass mux.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POST_DIV_SELECT_0</name>
                  <description>Divide by 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POST_DIV_SELECT_1</name>
                  <description>Divide by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POST_DIV_SELECT_2</name>
                  <description>Divide by 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>1 - PLL is currently locked. 0 - PLL is not currently locked.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
