Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
        <register>
          <name>LOWPWR_CTRL_SET</name>
          <description>XTAL OSC (LP) Control Register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RC_OSC_EN</name>
              <description>RC Osc. enable control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_OSC_EN_0</name>
                  <description>Use XTAL OSC to source the 24MHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_OSC_EN_1</name>
                  <description>Use RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_SEL</name>
              <description>Select the source for the 24MHz clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_SEL_0</name>
                  <description>XTAL OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_SEL_1</name>
                  <description>RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_SEL</name>
              <description>Bandgap select. Not related to oscillator.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPBG_SEL_0</name>
                  <description>Normal power bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPBG_SEL_1</name>
                  <description>Low power bandgap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_TEST</name>
              <description>Low power bandgap test bit. Not related to oscillator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTOP_IBIAS_OFF</name>
              <description>Low power reftop ibias disable. Not related to oscillator.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_PWRGATE</name>
              <description>L1 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_PWRGATE</name>
              <description>L2 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PWRGATE</name>
              <description>CPU power gate control. Used as software override. Test purpose only Not related to oscillator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAY_PWRGATE</name>
              <description>Display logic power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_CG_OVERRIDE</name>
              <description>For debug purposes only</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTALOSC_PWRUP_DELAY</name>
              <description>Specifies the time delay between when the 24MHz xtal is powered up until it is stable and ready to use</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_0</name>
                  <description>0.25ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_1</name>
                  <description>0.5ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_2</name>
                  <description>1ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_3</name>
                  <description>2ms</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOSC_PWRUP_STAT</name>
              <description>Status of the 24MHz xtal oscillator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_0</name>
                  <description>Not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_1</name>
                  <description>Stable and ready to use</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIX_PWRGATE</name>
              <description>Display power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPU_PWRGATE</name>
              <description>GPU power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWPWR_CTRL_CLR</name>
          <description>XTAL OSC (LP) Control Register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RC_OSC_EN</name>
              <description>RC Osc. enable control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_OSC_EN_0</name>
                  <description>Use XTAL OSC to source the 24MHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_OSC_EN_1</name>
                  <description>Use RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_SEL</name>
              <description>Select the source for the 24MHz clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_SEL_0</name>
                  <description>XTAL OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_SEL_1</name>
                  <description>RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_SEL</name>
              <description>Bandgap select. Not related to oscillator.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPBG_SEL_0</name>
                  <description>Normal power bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPBG_SEL_1</name>
                  <description>Low power bandgap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_TEST</name>
              <description>Low power bandgap test bit. Not related to oscillator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTOP_IBIAS_OFF</name>
              <description>Low power reftop ibias disable. Not related to oscillator.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_PWRGATE</name>
              <description>L1 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_PWRGATE</name>
              <description>L2 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PWRGATE</name>
              <description>CPU power gate control. Used as software override. Test purpose only Not related to oscillator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAY_PWRGATE</name>
              <description>Display logic power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_CG_OVERRIDE</name>
              <description>For debug purposes only</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTALOSC_PWRUP_DELAY</name>
              <description>Specifies the time delay between when the 24MHz xtal is powered up until it is stable and ready to use</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_0</name>
                  <description>0.25ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_1</name>
                  <description>0.5ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_2</name>
                  <description>1ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_3</name>
                  <description>2ms</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOSC_PWRUP_STAT</name>
              <description>Status of the 24MHz xtal oscillator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_0</name>
                  <description>Not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_1</name>
                  <description>Stable and ready to use</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIX_PWRGATE</name>
              <description>Display power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPU_PWRGATE</name>
              <description>GPU power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWPWR_CTRL_TOG</name>
          <description>XTAL OSC (LP) Control Register</description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RC_OSC_EN</name>
              <description>RC Osc. enable control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_OSC_EN_0</name>
                  <description>Use XTAL OSC to source the 24MHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_OSC_EN_1</name>
                  <description>Use RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_SEL</name>
              <description>Select the source for the 24MHz clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_SEL_0</name>
                  <description>XTAL OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_SEL_1</name>
                  <description>RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_SEL</name>
              <description>Bandgap select. Not related to oscillator.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPBG_SEL_0</name>
                  <description>Normal power bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPBG_SEL_1</name>
                  <description>Low power bandgap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_TEST</name>
              <description>Low power bandgap test bit. Not related to oscillator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTOP_IBIAS_OFF</name>
              <description>Low power reftop ibias disable. Not related to oscillator.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_PWRGATE</name>
              <description>L1 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_PWRGATE</name>
              <description>L2 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PWRGATE</name>
              <description>CPU power gate control. Used as software override. Test purpose only Not related to oscillator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAY_PWRGATE</name>
              <description>Display logic power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_CG_OVERRIDE</name>
              <description>For debug purposes only</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTALOSC_PWRUP_DELAY</name>
              <description>Specifies the time delay between when the 24MHz xtal is powered up until it is stable and ready to use</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_0</name>
                  <description>0.25ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_1</name>
                  <description>0.5ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_2</name>
                  <description>1ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_3</name>
                  <description>2ms</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOSC_PWRUP_STAT</name>
              <description>Status of the 24MHz xtal oscillator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_0</name>
                  <description>Not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_1</name>
                  <description>Stable and ready to use</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIX_PWRGATE</name>
              <description>Display power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPU_PWRGATE</name>
              <description>GPU power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
