Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
          <register>
            <name>TCD_ATTR</name>
            <description>TCD Transfer Attributes</description>
            <addressOffset>0x6</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DSIZE</name>
                <description>Destination data transfer size</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMOD</name>
                <description>Destination Address Modulo</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SSIZE</name>
                <description>Source data transfer size</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EIGHT</name>
                    <description>8-bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEEN_BIT</name>
                    <description>16-bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THIRTYTWO_BIT</name>
                    <description>32-bit</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTYFOUR</name>
                    <description>64-bit</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THIRTYTWO_BYTE</name>
                    <description>32-byte burst (4 beats of 64 bits)</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SMOD</name>
                <description>Source Address Modulo</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Source address modulo feature is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_1</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_2</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_3</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_4</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_5</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_6</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_7</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_8</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED_9</name>
                    <description>Value defines address range used to set up circular data queue</description>
                    <value>0x9</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_NBYTES_MLNO</name>
            <description>TCD Minor Byte Count (Minor Loop Mapping Disabled)</description>
            <alternateGroup>MLNO</alternateGroup>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>NBYTES</name>
                <description>Minor Byte Transfer Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_NBYTES_MLOFFNO</name>
            <description>TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)</description>
            <alternateGroup>MLOFFNO</alternateGroup>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>NBYTES</name>
                <description>Minor Byte Transfer Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMLOE</name>
                <description>Destination Minor Loop Offset Enable</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>The minor loop offset is not applied to the DADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>The minor loop offset is applied to the DADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SMLOE</name>
                <description>Source Minor Loop Offset Enable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>The minor loop offset is not applied to the SADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>The minor loop offset is applied to the SADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_NBYTES_MLOFFYES</name>
            <description>TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)</description>
            <alternateGroup>MLOFFYES</alternateGroup>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>NBYTES</name>
                <description>Minor Byte Transfer Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MLOFF</name>
                <description>If SMLOE = 1 or DMLOE = 1, this field represents a sign-extended offset applied to the source or destination address to form the next-state value after the minor loop completes.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMLOE</name>
                <description>Destination Minor Loop Offset Enable</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>The minor loop offset is not applied to the DADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>The minor loop offset is applied to the DADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SMLOE</name>
                <description>Source Minor Loop Offset Enable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>The minor loop offset is not applied to the SADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>The minor loop offset is applied to the SADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_SLAST</name>
            <description>TCD Last Source Address Adjustment</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>SLAST</name>
                <description>Last Source Address Adjustment</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_DADDR</name>
            <description>TCD Destination Address</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DADDR</name>
                <description>Destination Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_DOFF</name>
            <description>TCD Signed Destination Address Offset</description>
            <addressOffset>0x14</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DOFF</name>
                <description>Destination Address Signed Offset</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_CITER_ELINKNO</name>
            <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
            <alternateGroup>NO</alternateGroup>
            <addressOffset>0x16</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>CITER</name>
                <description>Current Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enable channel-to-channel linking on minor-loop complete</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Channel-to-channel linking is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Channel-to-channel linking is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_CITER_ELINKYES</name>
            <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
            <alternateGroup>YES</alternateGroup>
            <addressOffset>0x16</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>CITER</name>
                <description>Current Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINKCH</name>
                <description>Minor Loop Link Channel Number</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enable channel-to-channel linking on minor-loop complete</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Channel-to-channel linking is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Channel-to-channel linking is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_DLASTSGA</name>
            <description>TCD Last Destination Address Adjustment/Scatter Gather Address</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DLASTSGA</name>
                <description>Destination last address adjustment, or next memory address TCD for channel (scatter/gather)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
