Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SEMC</name>
      <description>SEMC</description>
      <groupName>SEMC</groupName>
      <baseAddress>0x402F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SEMC</name>
        <value>109</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWRST_0</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWRST_1</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDIS_0</name>
                  <description>Module enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDIS_1</name>
                  <description>Module disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSMD</name>
              <description>DQS (read strobe) mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DQSMD_0</name>
                  <description>Dummy read strobe loopbacked internally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DQSMD_1</name>
                  <description>Dummy read strobe loopbacked from DQS pad</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPOL0</name>
              <description>WAIT/RDY polarity for SRAM/NOR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPOL0_0</name>
                  <description>WAIT/RDY polarity is not changed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPOL0_1</name>
                  <description>WAIT/RDY polarity is inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPOL1</name>
              <description>R/B# polarity for NAND device</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPOL1_0</name>
                  <description>R/B# polarity is not changed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPOL1_1</name>
                  <description>R/B# polarity is inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTO</name>
              <description>Command Execution timeout cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTO</name>
              <description>Bus timeout cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTO_0</name>
                  <description>255*1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_1</name>
                  <description>255*2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_31</name>
                  <description>255*231</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCR</name>
          <description>IO MUX Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_A8</name>
              <description>SEMC_ADDR08 output selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_A8_0</name>
                  <description>SDRAM Address bit 8 (A8) or NOR/SRAM Address bit 24 (A24) in ADMUX 16bit mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_1</name>
                  <description>NAND CE#</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_2</name>
                  <description>NOR CE#</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_3</name>
                  <description>SRAM CE#</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_4</name>
                  <description>DBI CSX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_5</name>
                  <description>SDRAM Address bit 8 (A8) or NOR/SRAM Address bit 24 (A24) in ADMUX 16bit mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_6</name>
                  <description>SDRAM Address bit 8 (A8) or NOR/SRAM Address bit 24 (A24) in ADMUX 16bit mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_7</name>
                  <description>SDRAM Address bit 8 (A8) or NOR/SRAM Address bit 24 (A24) in ADMUX 16bit mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX0</name>
              <description>SEMC_CSX0 output selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX0_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_6</name>
                  <description>SRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX1</name>
              <description>SEMC_CSX1 output selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX1_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_6</name>
                  <description>SRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX2</name>
              <description>SEMC_CSX2 output selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX2_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_6</name>
                  <description>SRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX3</name>
              <description>SEMC_CSX3 output selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX3_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_6</name>
                  <description>SRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_RDY</name>
              <description>SEMC_RDY function selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_RDY_0</name>
                  <description>NAND R/B# input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_4</name>
                  <description>NOR CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_5</name>
                  <description>SRAM CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_6</name>
                  <description>DBI CSX</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CLKX0</name>
              <description>SEMC_CLKX0 function selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CLKX0_0</name>
                  <description>NOR clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX0_1</name>
                  <description>SRAM clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CLKX1</name>
              <description>SEMC_CLKX1 function selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CLKX1_0</name>
                  <description>NOR clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX1_1</name>
                  <description>SRAM clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCR0</name>
          <description>Bus (AXI) Master Control Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WQOS</name>
              <description>Weight of QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAGE</name>
              <description>Weight of AGE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WSH</name>
              <description>Weight of Slave Hit without read/write switch</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRWS</name>
              <description>Weight of slave hit with Read/Write Switch</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCR1</name>
          <description>Bus (AXI) Master Control Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WQOS</name>
              <description>Weight of QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAGE</name>
              <description>Weight of AGE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPH</name>
              <description>Weight of Page Hit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRWS</name>
              <description>Weight of slave hit without Read/Write Switch</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBR</name>
              <description>Weight of Bank Rotation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
