Masmiseim36/nxpSDK/devices/MIMXRT1043/MIMXRT1043.xml
        <register>
          <name>STS12</name>
          <description>Status Register 12</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NDADDR</name>
              <description>This field indicating the last write address (AXI command) to NAND device (without base address in SEMC_BR4).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STS13</name>
          <description>Status Register 13</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLVLOCK</name>
              <description>Sample clock slave delay line locked.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLVLOCK_0</name>
                  <description>Slave delay line is not locked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLVLOCK_1</name>
                  <description>Slave delay line is locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFLOCK</name>
              <description>Sample clock reference delay line locked.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFLOCK_0</name>
                  <description>Reference delay line is not locked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFLOCK_1</name>
                  <description>Reference delay line is locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLVSEL</name>
              <description>Sample clock slave delay line delay cell number selection.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Sample clock reference delay line delay cell number selection.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STS14</name>
          <description>Status Register 14</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>STS15</name>
          <description>Status Register 15</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCP</name>
      <description>DCP register reference index</description>
      <groupName>DCP</groupName>
      <prependToName>DCP_</prependToName>
      <baseAddress>0x402FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x434</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DCP</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>DCP_VMI</name>
        <value>51</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>DCP control register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_SET</name>
          <description>DCP control register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLR</name>
          <description>DCP control register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_TOG</name>
          <description>DCP control register 0</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
